app/views/shared/_notification.html.erb

  <button class="btn btn-secondary bg-dark-subtle rounded border-0 text-black dropdown-toggle" type="button" id="notificationDropdown" data-bs-toggle="dropdown" aria-expanded="false">
    <img src="<%= asset_path('notification.png') %>" width="20" height="25"> <%= Notification.where(user_id: current_user).count %>
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = $1  [["user_id", 1]]

  <ul class="dropdown-menu" aria-labelledby="notificationDropdown">
    <% if Notification.where(user_id: current_user).count != 0 %>
      <% Notification.where(user_id: current_user).each do |notification| %>
---
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = $1  [["user_id", 1]]
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1  [["user_id", 1]]