app/sidekiq/upload_job.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Olá"], ["content", "Teste 1"], ["created_at", "2025-01-06 17:48:29.271129"], ["updated_at", "2025-01-06 17:48:29.271129"], ["user_id", 1]]
---
  def perform(title, content, current_user)
    Post.create!(user_id: current_user, title: title, content: content)