app/sidekiq/uploadtag_job.rb

INSERT INTO "tags" ("post_id", "tag_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 102], ["tag_name", "\"ola\""], ["created_at", "2025-01-05 01:26:21.863084"], ["updated_at", "2025-01-05 01:26:21.863084"]]
---
  def perform(tag_name, post_id)
    Tag.create!(tag_name: tag_name, post_id: post_id)