app/views/posts/index.html.erb

                        <h2 class="post-title"><%= post.title %></h2>
                        <% Tag.where(post_id: post.id).each do |tag| %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."post_id" = $1  [["post_id", 103]]

                    <p class="post-meta">
                        Posted by <%= User.find(post.user_id).name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]