app/views/posts/show.html.erb

SELECT "tags".* FROM "tags" WHERE "tags"."post_id" = $1  [["post_id", 102]]
---
            <h3 class="post-subtitle text-right"><%= @post.content%></h3>
            <% Tag.where(post_id: @post.id).each do |tag| %>

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 102], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          <p class="post-meta">
            <%= t('views.posts.posted_by', user: User.find(@post.user_id).name, date: l(@post.created_at, format: :long)) %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 123]]
---
      <div>
        <% @post.comments.each do |comment| %>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                <% else %>
                  <h4><%= User.find(comment.user_id).name %></h4>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
              <p class="post-meta">
                <%= t('views.posts.created_by', user: User.find(comment.user_id).name, date: l(comment.created_at, format: :long)) %>