app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "created_at", "updated_at", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "ghjklç"], ["user_id", 2], ["created_at", "2025-01-05 01:19:56.756646"], ["updated_at", "2025-01-05 01:19:56.756646"], ["post_id", 102]]
INSERT INTO "notifications" ("post_id", "comment_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post_id", 102], ["comment_id", 504], ["user_id", 1], ["created_at", "2025-01-05 01:19:56.942672"], ["updated_at", "2025-01-05 01:19:56.942672"]]
---
  def create
    @comment = Comment.new(comment_params)
    if current_user != nil
      @comment.user_id = current_user.id
    else
      @comment.user_id = nil
    end
    @comment.post = @post
    if @comment.save
      comment_id = @comment.id
      @notifications = Notification.create(user_id: @post.user_id, post_id: @post.id, comment_id: comment_id)