app/controllers/posts_controller.rb

  def index
    @posts = Post.order(updated_at: :desc).page(params[:page])
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."updated_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def show
    if @delete_notification
      Notification.where(post_id: @post.id, user_id: current_user.id).destroy_all
---
DELETE FROM "notifications" WHERE "notifications"."id" = $1  [["id", 6]]
SELECT "notifications".* FROM "notifications" WHERE "notifications"."post_id" = $1 AND "notifications"."user_id" = $2  [["post_id", 103], ["user_id", 1]]

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Testando"], ["content", "ad"], ["created_at", "2025-01-06 00:16:23.111134"], ["updated_at", "2025-01-06 00:16:23.111134"], ["user_id", 1]]

  def verify_user
    if current_user && current_user.id == Post.find(params[:id]).user_id
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 119], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]