app/controllers/search_controller.rb

  def index
    @query = Post.ransack(params[:q])
    @posts = @query.result.page(params[:page])
---
SELECT "posts".* FROM "posts" LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"